package by.nj.dusty;

import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.List;

public class ExpandableData {

    public static HashMap<String, List<String>> getData() {
        HashMap<String, List<String>> expandableListDetail = new HashMap<String, List<String>>();
        ArrayList<String> parent = new ArrayList<String>();

        parent.add("Метод изучения персонала, включающий оценку результатов деятельности работника за определенный период времени, с проверкой его соответствия занимаемой должности и возможностей его дальнейшего служебного продвижения.\n\n");
        parent.add("Аттестация персонала организации проводится в целях объективной оценки уровня необходимой компетентности на основе соответсвующего образования, подготовки и опыта.\n\n" +
                "Аттестаци персонала гарантирует специальную подготовку и дает право участия в разработке, изготовлении, контроля качества и поставке изделий, поставляемых по действующим ТНПА.\n\n" +
                "Персональная ответственность за поддержание необходимой компетентности работников, реализацию образовательных программ обучения и аттестацию персонала возлагается на руководителей структурныъ подразделений.\n\n" +
                "Уровень технических знаний персонала должен соответствовать квалификационной характеристике разрада по выполняемой работе в соответствии с ЕТКС.\n\n" +
                "Реализация образовательных программ повышения квалификации, переподготовки, профессиональной подготовки персонала проводится непрерывно и в плановом порядке по программам для каждой профессии, разработанной на основе отраслевых программ и включающих в себя:\n\n" +
                " - ознакомлении с принципами действия, конструктивным устройством, назначением, применением изделий и требованиями заказчиков к изготовляемым изделиям;\n\n" +
                " - изучение технического процесса, обучение работе на технологическом оборудовании, со средствами испытаний и измерений, наимолее эффективным приемам работ;\n\n" +
                " - изучение технической документации;\n\n" +
                " - обучения методам статического контроля и статического регулирования, принципам и методам сомоконтроля работников, обязанностям и полномочиям в области принятия корректирующих и предупреждающих действий по регулированию технологического процесса при технических неполадках и других управляющих воздействий на производство;\n\n" +
                " - ознакомление с характерными несоответствиями (дефектами) изделий, в том числе возникающими на предыдущих операциях, причинамии их возникновения и принимаемыми мерами по их странению;\n\n" +
                " - ознакомление с формами ответственности за выпуск изделий с нарушениями требований технической документации;\n\n" +
                " - воспитание ответственности за качество выполняемой работы, включая ознакомление с взаимосвязями качествами работы на конкретном месте с экономическим положением и мерами по материальному стимулированию персонала за качество;\n\n" +
                " - осведамленность о принципаъ постороения, функционтрования, анализа и оценки СМК, о методах и целях реализации Политики в области качества, Политики в области качества Филиала Завод Электроника, о последствиях несоответствий требований СМК;\n\n" +
                " - ознакомления с документацией СМК;\n\n" +
                " - ознакомление с применением современных методов и средств контроля, обучения формам и методам взаимодействия с потребителем, организации и управления производством;\n\n" +
                " Программы обучения должны включать в себя полный объем информации, необходимой для данной профессии и содержащиййся в технической документации.\n\n" +
                "Прорядок разработки, утверждения учебных программ осуществляется согласно 'ПОЛОЖЕНИЮ'\n\n" +
                "Непрерывное профессиональное обучение персонала осуществляется согласно СТО И4.12\n\n" +
                "Персонал, участвующий в реализации мероприятий по повышению качества изделий и обеспечивающий изготовление качественных изделий поощряется в соответствии с действующим в организации порядком материального и могального стимулирования. Полядок материального и морального стимулирования установлен в положениях о премировании, в контрактах, трудовых соглашениях с работниками, и других локальных нормативных правовых актах.\n\n" +
                "Для персонала, участвующего в производстве изделий категории качества 'ВП', производится доплата в размере от 5% до 10% от тарифной ставки присвоенного разряда или должностного оклада.\n\n" +
                "Для персонала, участвующего в производстве изделий категории качества 'ОСМ' и 'Н', производится доплата в размере о т10% до 20% от тарифной ставки присвоенного разряда или должностного оклада\n\n" +
                "Размеры (проценты) даплат устанавливают согласно положениям, разрабатываемым структурными подраздлениями с учетом вклада каждого сотрудника, участвующего в производстве изделий категории качества 'ВП', 'ОСМ' и 'Н'.\n\n" +
                "Проверку выполнения требований настоящего стандарта осуществляют в ходе проведения внутреннего аудита СМК в соответствии с СТО И4ю20 и контроля соблюдения технологической дисциплины по СТО И4.75.\n\n");

        parent.add("Способность применять знания и навыки для достежения намеченных результатов (СТБ ISO 9000).");
        parent.add("Понимание персоналом обязанностей и вклада своих действий в достижение целей организации.");
        parent.add("Личный состав организации, или часть этого состава, представаляющая собой группу по профессиональным или иным признакам.");
        parent.add("Процесс обучения, направленный на профессиональное совершенствование персонала, который осуществляется в течение всей трудовой деятельности.");
        parent.add("Единица промышленной продукции, количество которой может исчисляться в штуках(экземплярах)(СТБ 1218).\n\nПримечание - изделиями являются изделия качества 'ВП', 'ОСМ' и 'Н' и изделия производственно-технического назначения и народного потребления.");
        parent.add("Изделия, для которых устанавливаемый в конструкторской и технологической документации, стандартах и технических условиях уровень требований к надежности и другим эксплуатационным свойствам, а также к обеспечению и контролю качества обуславливает приготность их применения в наземной, морской и авиационной аппаратуре, отказ которой ведет к существенным последствиям, ремонт и замена которой ведется на уровне ячеек и блоков (ГОСТ РВ 20.39.411[1]).");
        parent.add("Изделия, для которых устанавливаемый в конструкторской и технологической документации, стандартах и технологических условиях уровень требований к надежности и другим эксплуатационным свойствам, а также к обеспечению и контролю качества обуславливает пригодность их применения в аппаратуре космической и ракетной техники, специальной правительственной связи и другой, отказ которой ведет к катастрофическим последствиям, ремонт и замена кооторой труднодоступны или невозможны (ГОСТ РВ 20.39.411[1]).");
        parent.add("Изделия поставляемые малыми партиями и имеющие особенности обеспечения и контроля их качества, указываемые в технологической документации, стандартах и технической документации, стандартах и технических условиях на изделия (ГОСТ РВ 20.39.411 [1]).");
        parent.add("Бескорпусные изделия, изготавливаемые с учетом требований РМ 11 091.926[15].");
        parent.add("Интегральные микросхемы, полупроводниковые приборы, торговое и банковское оборудование, средства отображения информации и средства измерения, карточки идентификационные, видеомониторы, медицинские изделия, жидкокристаллические индикаторы, пластины монокристаллическоого кремния.");
        parent.add("АК - аттестационная коммисия;\n" +
                "ДСП - для служебного пользования;\n" +
                "ЕТКС - единый тарифно-квалификационный справочник работ и профессий рабочих;\n" +
                "ЛК - личное клеймо;\n" +
                "ОИЦ - опытно-измерительный центр Филиала Научно-технический центр 'Белмикросистемы';\n" +
                "ОТК - отдел технического контроля управления качеством и (или) бюро технического контроля центра испытаний и контроля качества продукции Филиала Научно-технический центр 'Белмикросистемы', и (или) отдел технического контроля служюбы менеджмента качества Филиала 'Камертон'\n" +
                "ОУК - отдел управления кадрами Филиала 'Камертон';\n" +
                "Служба МК - служба менеджмента качества Филиала 'Камертон';\n" +
                "СМК - система менеджмента качества;\n" +
                "ТД - технологическая документация;\n" +
                "ТНПА - технический нормативный правовой акт в области технического норматирования и стандартизации;\n" +
                "УК - управления качеством;\n" +
                "УП - управление персоналом;\n" +
                "Филиал НТЦ Белмикросистемы - Филиал Научно-технический центр Белмикросистемы;\n" +
                "ЦМККП - центр испытаний и контроля качества продукции Филиала Научно-технический центр 'Белмикросистемы';\n" +
                "ЦЭТ - центр электронной техники Филиала Научно-технический центр 'Белмикросистемы'.");
        parent.add("вводный;\n\n" +
                " - первичный на рабочем месте;\n\n" +
                " - повторный;\n\n" +
                " - внеплановый;\n\n" +
                " - целевой.\n\n");
        parent.add("Инструкция поохране труда - локальный правовой акт, содержащий требования поохране труда для профессий рабочих и(или) отдельных видов работ (услуг.\n" +
                "Работодатели  разрабатывают  ипринимают  инструкции  по охране  труда  для профессий  рабочих  и(или)  отдельных  видов  работ  (услуг)  в порядке,  установленном Министерством труда и социальной защиты.\n" +
                "Инструкции поохране труда должны содержать общие требования по охране труда, требования по охране труда перед началом работы, при ее выполнении, по окончании работы, в аварийных ситуациях.\n" +
                "В инструкции поохране труда с учетом специфики профессий рабочих и(или) видов работ (услуг) могут включаться другие требования по охране труда. \n" +
                "Не допускается включение в типовую инструкцию по охране труда, инструкцию по охране  труда  отсылочных  норм  нанормативные  правовые  акты,  в том  числе технические  нормативные  правовые  акты,  содержащие  требования  по охране  труда, заисключением отсылочных норм наиные инструкции по охране труда, действующие в организации.\n" +
                "При  отсутствии  специфики  профессий  рабочих  и(или)  видов  работ  (услуг) работодатели, втом числе ненаделенные правом принятия локальных правовых актов, могут руководствоваться соответствующими типовыми инструкциями по охране труда.");
        parent.add("Гражданину, обнаружившему пожар, необходимо:\n" +
                " - немедленно сообщить по телефону \"101\" или \"112\" или непосредственно в пожарное аварийно-спасательное подразделение адрес и место пожара;\n" +
                " - принять меры по оповещению людей и их эвакуации;\n" +
                " - принять возможные меры по тушению пожара имеющимися первичными средствами пожаротушения.\n" +
                " - Руководитель (должностное лицо) объекта, прибывший к месту пожара, обязан:\n" +
                " - проверить, вызваны ли пожарные аварийно-спасательные подразделения, ДПД. Направить для встречи пожарных аварийно-спасательных подразделений лицо, хорошо знающее расположение подъездных путей и водоисточников;\n" +
                " - до прибытия пожарных аварийно-спасательных подразделений:\n" +
                " - организовать эвакуацию людей, принять меры по предотвращению паники;\n" +
                " - вызвать при необходимости к месту пожара медицинскую помощь, а также аварийные службы;\n" +
                " - организовать с помощью членов ДПД и других работников тушение пожара имеющимися первичными средствами пожаротушения и применение ТСППЗ в соответствии с планом эвакуации людей;(в ред. постановления МЧС от 25.02.2016 N 14)\n" +
                " - организовать мероприятия по защите людей, принимающих участие в тушении пожара, от возможных обрушений конструкций, поражений электрическим током, отравлений, ожогов;\n" +
                " - проверить включение в работу ТСППЗ;\n" +
                " - организовать отключение электроэнергии от потребителей без отключения ТСППЗ, остановку транспортирующих устройств, агрегатов, емкостных сооружений, перекрытие газовых коммуникаций, остановку систем вентиляции, приведение в действие системы дымоудаления и осуществление других мероприятий, способствующих предотвращению распространения пожара;\n" +
                " - организовать по возможности эвакуацию материальных ценностей;\n" +
                " - обеспечить по прибытии пожарных аварийно-спасательных подразделений доступ в помещения согласно указаниям руководителя тушения пожара.\n" +
                " - По прибытии на пожар пожарных аварийно-спасательных подразделений руководитель (должностное лицо) объекта обязан сообщить руководителю тушения пожара сведения о месте пожара, наличии в помещениях людей, нуждающихся в помощи, а также о людях, занятых ликвидацией очагов горения, наличии взрывопожароопасных материалов, баллонов с газом под давлением, ЛВЖ, ГЖ и о мерах, предпринятых по ликвидации пожара.\n" +
                " - Руководитель (должностное лицо) объекта при включении в состав штаба на пожаре обязан:\n" +
                " - обеспечить выполнение задач, поставленных руководителем тушения пожара;\n" +
                " - предоставлять информацию руководителю тушения пожара об особенностях объекта;\n" +
                " - координировать действия работников объекта при выполнении задач, поставленных руководителем тушения пожара.\n");
        parent.add("Технологические процессы должны проводиться в соответствии с регламентами, правилами технической эксплуатации, технологическими инструкциями и другой утвержденной в установленном порядке нормативно-технической, эксплуатационной и технологической документацией. п. 49 в ред. постановления МЧС от 25.02.2016 N 14)\n\n" +
                " - Горючая среда, образуемая в процессе производства, должна быть изолирована от источников зажигания, а ее концентрация и температура должны быть такими, чтобы исключалось образование взрывоопасных смесей.\n\n" +
                " - В производственных зданиях, помещениях вещества и материалы, используемые в технологическом процессе и способные при взаимном контакте к экзотермическим реакциям, должны размещаться в специально отведенных для этого зонах, не допускающих контакта этих веществ даже в случаях аварийных ситуаций. При транспортировке веществ и материалов необходимо учитывать их агрегатное состояние, совместимость, а также однородность средств тушения согласно приложению 9.\n\n" +
                " - Расходное количество горючих веществ и материалов, используемое в технологическом процессе, разрешается хранить в помещении непосредственно возле установок и оборудования в количестве, предусмотренном технологическими регламентами (картами и т.п.), но не более сменной нормы.\n\n" +
                " - При сушке одежды в специальных шкафах должен контролироваться установленный температурный режим.\n\n" +
                "Загружать помещения для сушки одежды промасленной одеждой, тканями, а также одеждой с находящимися в ней спичками, зажигалками и горючими материалами не допускается. Сырая промасленная одежда должна просушиваться на открытом воздухе в развернутом виде.\n\n" +
                " - Техническое обслуживание, ремонт, проведение испытаний, освидетельствование, диагностирование оборудования, трубопроводов, емкостных сооружений, коммуникаций должны проводиться в установленные сроки и при выполнении мер пожарной безопасности, предусмотренных соответствующей технической документацией по эксплуатации.\n\n" +
                " - Для мойки (обезжиривания) изделий (деталей) машин и оборудования должны применяться негорючие технические жидкости и составы, а также безопасные в пожарном отношении установки и способы.\n\n" +
                " - Запрещается выполнять производственные операции на оборудовании и установках с неисправностями, которые могут привести к пожарам, а также при отключении средств измерений, автоматизации, систем контроля, управления и противоаварийной автоматической защиты, определяющих заданные режимы температуры, давления, концентрации и других технологических параметров горючих газов, паров, жидкостей.\n\n" +
                " - Расстановка оборудования должна обеспечивать свободные проходы и подходы к нему.\n\n" +
                " - Оборудование и тара для переработки и хранения легковоспламеняющихся и горючих веществ и материалов должны быть герметичны. Состояние уплотнений должно периодически контролироваться и при повреждении, износе восстанавливаться.\n" +
                " - На столах и в вытяжных шкафах, где проводятся работы с открытым огнем и электронагревательными приборами, не допускается хранение ЛВЖ и ГЖ, переливание их и загрузка ими оборудования. Временное хранение в вытяжных шкафах взрывоопасных реактивов допускается с письменного разрешения ответственного за обеспечение пожарной безопасности в лаборатории. При нагревании ЛВЖ под прибор необходимо устанавливать кювету для предотвращения разлива жидкости в случае аварии.\n\n" +
                " - Во время работы оборудования в помещениях производства категорий А и Б должна исключаться возможность искрообразования. Полы в указанных помещениях должны быть выполнены из материалов, не образующих искр при ударе и трении. Тара внутри должна быть сухой и чистой, без следов коррозии. Технологическое оборудование, а также трубопроводы должны быть защищены от статического электричества. Текстильные ткани, применяемые во взрывоопасных зонах, должны быть пропитаны антистатиками.\n\n" +
                " - Все работы во взрывоопасных зонах необходимо выполнять с применением искробезопасных инструментов и оборудования в соответствующем взрывозащищенном исполнении. Специальная одежда персонала, работающего во взрывоопасных зонах, должна исключать образование и накопление статического электричества. (п. 61 в ред. постановления МЧС от 25.02.2016 N 14)\n\n" +
                " - При эксплуатации очистных устройств, предназначенных для улавливания взрывопожароопасных материалов, необходимо, чтобы:\n\n" +
                "очистка фильтрующих устройств производилась по мере накопления уловленных отходов;\n" +
                "выгрузка пыли из циклонов производилась при выключенном вентиляторе;\n" +
                "при ручной очистке и ремонте фильтрующих установок не допускалось применение открытого огня или искрообразующих инструментов;\n" +
                "осуществлялся контроль за исправностью предохранительных и огнезадерживающих устройств (клапаны, мембраны, огнепреградители);\n" +
                "при улавливании отходов, склонных к самовозгоранию, регулярно велся контроль за их температурой. При появлении очагов самовозгорания необходимо немедленно принимать меры по их ликвидации и удалению отходов и отложений в соответствии с технологическим регламентом.\n" +
                " - Двери и люки пылесборных камер и циклонов при их эксплуатации должны быть закрыты.\n\n" +
                " - При ведении технологических процессов не допускается отключать средства контроля, регулирования и системы противоаварийной защиты.\n\n" +
                "При необходимости отключение отдельного прибора для проверки, испытания и регулировки может быть допущено по письменному распоряжению должностного лица, определенного приказом, с обеспечением безопасности технологического процесса.\n" +
                " - При эксплуатации цехов, участков и установок окраски, обезжиривания и мойки следует соблюдать следующие требования:\n\n" +
                "эксплуатация окрасочных шкафов, камер и кабин при неисправной вытяжной вентиляции, оросителях (гидрофильтрах) или других эффективных устройств для улавливания частиц горючих красок и лаков, предусмотренных технической документацией, не допускается;\n" +
                "очистка окрасочного оборудования от горючих отложений должна проводиться при работающей вентиляции ежедневно после окончания смены. Скребки должны быть изготовлены из материала, исключающего искрообразование;\n" +
                "лакокрасочные материалы должны поступать на рабочие места в готовом виде в количестве, не превышающем сменную потребность (при круглосуточной работе - не более суточной).\n" +
                " - Вскрытие тары, расфасовка продукции, приготовление рабочих смесей взрыво- и пожароопасных веществ и материалов в местах хранения не допускается.\n\n" +
                " - Разогревать застывшие ЛВЖ, ГЖ, ледяные пробки в трубопроводах следует пожаробезопасным способом (горячей водой, паром, нагретым песком и т.д.). Запрещается применять для разогрева источники открытого огня и раскаленные предметы.\n" +
                " - Не допускается эксплуатировать без огнепреградителей (гидравлических затворов) или если они отключены:\n\n" +
                " - дыхательные линии от аппаратов и емкостей с ЛВЖ и ГЖ;\n\n" +
                " - линии ЛВЖ и ГЖ, работающие неполным сечением или периодически;\n\n" +
                " - газо- и паровоздушные линии, если в них могут образовываться смеси взрывоопасных концентраций.\n\n" +
                " - К местам установки огнепреградителей и гидравлических затворов должен быть свободный доступ для их осмотра и ремонта. Проверка состояния огнепреградителей, а при необходимости их очистка должны производиться в соответствии с эксплуатационной документацией и графиком, но не реже одного раза в 3 месяца (в ред. постановления МЧС от 25.02.2016 N 14).\n\n");
        parent.add("создаваемые техническими средствами, способныпричинять ущерб здоровью работников и их травмирование.");
        parent.add("Оказывают негативное воздействие на работников, котороеприводит к ухудшению самочувствия или заболеванию.\n" +
                "Опасности и вредности, приводящие к травмированию и заболеваемостиработников, могут быть реальными (очевидными) и скрытыми (потенциальными).Условия,   при   которых   потенциальная опасность может реализоваться,определяются как причина несчастного случая, травмирования и т.п");
        parent.add("Физические опасные и вредные факторы – это движущиеся машины имеханизмы; незащищенные подвижные элементы производственногооборудования;   передвигающиеся   изделия;   повышенное напряжение вэлектрических сетях; повышенный   уровень   статического   электричества;повышенный   уровень   электромагнитного,   рентгеновского,  лазерного и ультрафиолетового   излучения;   повышенный   уровень   вибрации   и   шума;недостаточное освещение; неблагоприятные метеорологические условия и др.\n\n" +
                "Химические опасные и вредные факторы представляют собой различныехимические элементы и их соединения, обладающие общетоксичными, раздражающими, мутагенными, сенсибилизирующими и канцерогенными свойствами. Наибольшей канцерогенностью обладают мышьяк, никель, кадмий,хлорфенол,   три-   и   тетрахлорэтилен,   винилхлорид,   бензапирен   и   другие смолистые летучие вещества.\n\n" +
                "К биологическим опасным и вредным факторам относятся микро- имакроорганизмы (бактерии, вирусы, грибы, растения, животные). Их воздействиена человека может приводить к травмам и инфекционным заболеваниям\n\n" +
                "Психофизиологические факторы включают в себя физические перегрузки(статические, динамические, гиподинамические), а также нервно-психическиеперегрузки, к которым относятся умственное перенапряжение, монотонность труда, эмоциональные перегрузки, перенапряжение органов чувств и др. Возникновение нервно-психических   перегрузок обусловлено изменениемхарактера современного производства, повышением сложности трудовой деятельности и существенным изменением функции и роли человека(человеческого фактора) в процессе труда, особенностями которого становится интенсификация психической деятельности человека.");
        parent.add("Оптимальные условия труда (1 класс)  –  это условия (устанавливаются для микроклиматических параметров), при которых:\n\n" +
                "– сохраняется здоровье работающих;\n" +
                "– создаются предпосылки для поддержания высокого уровня работоспособности.\n\n" +
                "Допустимые условия труда (2 класс) – это условия, при которых уровнифакторов среды трудового процесса не превышают гигиенических нормативов, а возможные изменения функционального состояния организма восстанавливаютсяво время регламентированного отдыха или к началу следующей смены.Допустимые условия труда условно относятся к безопасным.\n\n" +
                "Вредные условия труда  (3 класс)  –  это условия, при которых уровнивредных   техногенных   факторов   превышают   гигиенические   нормативы   и оказывают   неблагоприятное   действие   на   организм   работника   (и/или   его потомство).\n\n" +
                "Вредные   условия   по   степени   превышения   гигиенических   нормативов   и выраженности изменений в организме работающих подразделяются на 4 степени вредности.\n\n" +
                "I  степень (3.1)   –  это условия труда, при которых отклонения вредных факторов от гигиенических нормативов таковы, что вызывают функциональныеизменения, восстанавливающиеся при более длительном времени (чем к началу следующей смены), и увеличивают риск повреждения здоровья.\n\n" +
                "IIстепень (3.2)   –  это условия, при которых уровни вредных факторов вызывают   функциональные   изменения,   приводящие   в   большинстве   случаев   кувеличению заболеваемости.\n\n" +
                "IIIстепень (3.3)   –  это условия, при которых уровни вредных факторов таковы, что приводят к развитию профессиональных болезней легкой и среднейстепеней тяжести (с потерей профессиональной трудоспособности).\n\n" +
                "IV  степень (3.4)   –  это условия, при которых могут возникнуть тяжелые формы профессиональных заболеваний (с потерей общей трудоспособности).\n\n" +
                "Опасные (экстремальные) условия труда (4 класс)  –  это условия, прикоторых уровни техногенных факторов таковы, что в течение рабочей смены (или её части) создают угрозу для жизни, высокий риск развития острых профессиональных поражений, в том числе и тяжелых форм.");


        expandableListDetail.put("Аттестация", Collections.singletonList(parent.get(0)));
        expandableListDetail.put("План аттестации", Collections.singletonList(parent.get(1)));
        expandableListDetail.put("Компетентность", Collections.singletonList(parent.get(2)));
        expandableListDetail.put("Осведомленность", Collections.singletonList(parent.get(3)));
        expandableListDetail.put("Персонал", Collections.singletonList(parent.get(4)));
        expandableListDetail.put("Непрерывное профессиональное обучение", Collections.singletonList(parent.get(5)));
        expandableListDetail.put("Изделие", Collections.singletonList(parent.get(6)));
        expandableListDetail.put("Изделия категории качества 'ВП'", Collections.singletonList(parent.get(7)));
        expandableListDetail.put("Изделия категории качества 'ОС'", Collections.singletonList(parent.get(8)));
        expandableListDetail.put("Изделия категории качества 'ОСМ'", Collections.singletonList(parent.get(9)));
        expandableListDetail.put("Изделия категории качества 'Н'", Collections.singletonList(parent.get(10)));
        expandableListDetail.put("Изделия производственно-технического назначения и народного потребления", Collections.singletonList(parent.get(11)));
        expandableListDetail.put("Обозначения и сокращения", Collections.singletonList(parent.get(12)));
        expandableListDetail.put("По характеру ивремени проведения инструктаж поохране труда подразделяют на:", Collections.singletonList(parent.get(13)));
        expandableListDetail.put("Инструкции по охране труда", Collections.singletonList(parent.get(14)));
        expandableListDetail.put("Действия в случае возникновения пожара", Collections.singletonList(parent.get(15)));
        expandableListDetail.put("Организация технологического процесса", Collections.singletonList(parent.get(16)));
        expandableListDetail.put("Техногенные опасности", Collections.singletonList(parent.get(17)));
        expandableListDetail.put("Вредные факторы", Collections.singletonList(parent.get(18)));
        expandableListDetail.put("Физические, химические, биологически факторы", Collections.singletonList(parent.get(19)));
        expandableListDetail.put("Классы условий труда", Collections.singletonList(parent.get(20)));


        return expandableListDetail;
    }
}
